// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.


/*Console.Write("Imput namber N: ");
int N = int.Parse(Console.ReadLine());
int resalt = 1;

while(resalt <= N)
{
    Console.WriteLine(Math.Pow(resalt, 3));
    resalt++;
}
*/

//